benchmarks/results/20260308_235901/03_chat_messages.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: benchmarks/chat_load.js
        output: json (benchmarks/results/20260308_235901/03_chat_messages.json)

     scenarios: (100.00%) 1 scenario, 1 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 1 looping VUs for 1m0s over 2 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2026-03-09T00:01:04+05:30" level=info msg="[setup] Ready — conversationId=9" source=console

running (0m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 1/1 VUs  0m00.6s/1m00.0s

running (0m02.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 1/1 VUs  0m01.6s/1m00.0s

running (0m03.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 1/1 VUs  0m02.6s/1m00.0s

running (0m04.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
default   [   6% ] 1/1 VUs  0m03.6s/1m00.0s

running (0m05.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
default   [   8% ] 1/1 VUs  0m04.6s/1m00.0s

running (0m06.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
default   [   9% ] 1/1 VUs  0m05.6s/1m00.0s

running (0m07.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
default   [  11% ] 1/1 VUs  0m06.6s/1m00.0s

running (0m08.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
default   [  13% ] 1/1 VUs  0m07.6s/1m00.0s

running (0m09.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
default   [  14% ] 1/1 VUs  0m08.6s/1m00.0s

running (0m10.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
default   [  16% ] 1/1 VUs  0m09.6s/1m00.0s

running (0m11.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
default   [  18% ] 1/1 VUs  0m10.6s/1m00.0s

running (0m12.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
default   [  19% ] 1/1 VUs  0m11.6s/1m00.0s

running (0m13.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
default   [  21% ] 1/1 VUs  0m12.6s/1m00.0s

running (0m14.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
default   [  23% ] 1/1 VUs  0m13.6s/1m00.0s

running (0m15.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
default   [  24% ] 1/1 VUs  0m14.6s/1m00.0s

running (0m16.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
default   [  26% ] 1/1 VUs  0m15.6s/1m00.0s

running (0m17.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
default   [  28% ] 1/1 VUs  0m16.6s/1m00.0s

running (0m18.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
default   [  29% ] 1/1 VUs  0m17.6s/1m00.0s

running (0m19.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
default   [  31% ] 1/1 VUs  0m18.6s/1m00.0s

running (0m20.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
default   [  33% ] 1/1 VUs  0m19.6s/1m00.0s

running (0m21.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
default   [  34% ] 1/1 VUs  0m20.6s/1m00.0s

running (0m22.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
default   [  36% ] 1/1 VUs  0m21.6s/1m00.0s

running (0m23.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
default   [  38% ] 1/1 VUs  0m22.6s/1m00.0s

running (0m24.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
default   [  39% ] 1/1 VUs  0m23.6s/1m00.0s

running (0m25.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
default   [  41% ] 1/1 VUs  0m24.6s/1m00.0s

running (0m26.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
default   [  43% ] 1/1 VUs  0m25.6s/1m00.0s

running (0m27.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
default   [  44% ] 1/1 VUs  0m26.6s/1m00.0s

running (0m28.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
default   [  46% ] 1/1 VUs  0m27.6s/1m00.0s

running (0m29.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
default   [  48% ] 1/1 VUs  0m28.6s/1m00.0s

running (0m30.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
default   [  49% ] 1/1 VUs  0m29.6s/1m00.0s

running (0m31.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
default   [  51% ] 1/1 VUs  0m30.6s/1m00.0s

running (0m32.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
default   [  53% ] 1/1 VUs  0m31.6s/1m00.0s

running (0m33.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
default   [  54% ] 1/1 VUs  0m32.6s/1m00.0s

running (0m34.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
default   [  56% ] 1/1 VUs  0m33.6s/1m00.0s

running (0m35.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
default   [  58% ] 1/1 VUs  0m34.6s/1m00.0s

running (0m36.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
default   [  59% ] 1/1 VUs  0m35.6s/1m00.0s

running (0m37.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
default   [  61% ] 1/1 VUs  0m36.6s/1m00.0s

running (0m38.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
default   [  63% ] 1/1 VUs  0m37.6s/1m00.0s

running (0m39.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
default   [  64% ] 1/1 VUs  0m38.6s/1m00.0s

running (0m40.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
default   [  66% ] 1/1 VUs  0m39.6s/1m00.0s

running (0m41.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
default   [  68% ] 1/1 VUs  0m40.6s/1m00.0s

running (0m42.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
default   [  69% ] 1/1 VUs  0m41.6s/1m00.0s

running (0m43.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
default   [  71% ] 1/1 VUs  0m42.6s/1m00.0s

running (0m44.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
default   [  73% ] 1/1 VUs  0m43.6s/1m00.0s

running (0m45.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
default   [  74% ] 1/1 VUs  0m44.6s/1m00.0s

running (0m46.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
default   [  76% ] 1/1 VUs  0m45.6s/1m00.0s

running (0m47.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
default   [  78% ] 1/1 VUs  0m46.6s/1m00.0s

running (0m48.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
default   [  79% ] 1/1 VUs  0m47.6s/1m00.0s

running (0m49.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
default   [  81% ] 1/1 VUs  0m48.6s/1m00.0s

running (0m50.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
default   [  83% ] 1/1 VUs  0m49.6s/1m00.0s

running (0m51.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
default   [  84% ] 1/1 VUs  0m50.6s/1m00.0s

running (0m52.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
default   [  86% ] 1/1 VUs  0m51.6s/1m00.0s

running (0m53.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
default   [  88% ] 1/1 VUs  0m52.6s/1m00.0s

running (0m54.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
default   [  89% ] 1/1 VUs  0m53.6s/1m00.0s

running (0m55.0s), 1/1 VUs, 16 complete and 0 interrupted iterations
default   [  91% ] 1/1 VUs  0m54.6s/1m00.0s

running (0m56.0s), 1/1 VUs, 16 complete and 0 interrupted iterations
default   [  93% ] 1/1 VUs  0m55.6s/1m00.0s

running (0m57.0s), 1/1 VUs, 16 complete and 0 interrupted iterations
default   [  94% ] 1/1 VUs  0m56.6s/1m00.0s

running (0m58.0s), 1/1 VUs, 16 complete and 0 interrupted iterations
default   [  96% ] 1/1 VUs  0m57.6s/1m00.0s

running (0m59.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
default   [  98% ] 1/1 VUs  0m58.6s/1m00.0s

running (1m00.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
default   [  99% ] 1/1 VUs  0m59.6s/1m00.0s

running (1m01.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
default ↓ [ 100% ] 1/1 VUs  1m0s

     ✓ POST .../messages → 200 or 201
     ✓ POST .../messages → has content
     ✓ POST .../messages → p95 <3500ms

     █ setup

       ✓ setup: login 200
       ✓ setup: token present
       ✓ setup: conversation 201
       ✓ setup: conversation id present

     checks.........................: 100.00% 58 out of 58
     data_received..................: 25 kB   404 B/s
     data_sent......................: 8.4 kB  136 B/s
     http_req_blocked...............: avg=33.47µs  min=5.7µs   med=7.31µs   max=333.31µs p(50)=7.31µs   p(95)=228.06µs p(99)=312.26µs
     http_req_connecting............: avg=17.24µs  min=0s      med=0s       max=201.87µs p(50)=0s       p(95)=160.33µs p(99)=193.56µs
     http_req_duration..............: avg=1.21s    min=2.76ms  med=1.33s    max=1.66s    p(50)=1.33s    p(95)=1.62s    p(99)=1.65s   
       { expected_response:true }...: avg=1.27s    min=15.01ms med=1.33s    max=1.66s    p(50)=1.33s    p(95)=1.62s    p(99)=1.66s   
     ✓ { name:chat_message }........: avg=1.38s    min=1.1s    med=1.34s    max=1.66s    p(50)=1.34s    p(95)=1.63s    p(99)=1.66s   
     http_req_failed................: 4.76%   1 out of 21
     ✓ { name:chat_message }........: 0.00%   0 out of 18
     http_req_receiving.............: avg=111.19µs min=85.48µs med=105.48µs max=154.08µs p(50)=105.48µs p(95)=140.39µs p(99)=151.34µs
     http_req_sending...............: avg=58.38µs  min=28.66µs med=51.59µs  max=193.28µs p(50)=51.59µs  p(95)=115.83µs p(99)=177.79µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(50)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=1.21s    min=2.53ms  med=1.33s    max=1.66s    p(50)=1.33s    p(95)=1.62s    p(99)=1.65s   
     http_reqs......................: 21      0.341748/s
     iteration_duration.............: avg=3.38s    min=3.1s    med=3.34s    max=3.66s    p(50)=3.34s    p(95)=3.63s    p(99)=3.66s   
     iterations.....................: 18      0.292927/s
     vus............................: 1       min=1        max=1
     vus_max........................: 1       min=1        max=1


running (1m01.4s), 0/1 VUs, 18 complete and 0 interrupted iterations
default ✓ [ 100% ] 0/1 VUs  1m0s